{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 256,
            "activation": "relu",
            "name": "dense_0",
            "dtype": "float32",
            "batch_input_shape": [
              null,
              6
            ]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 256,
            "activation": "relu",
            "name": "dense_1",
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_2",
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "linear",
            "name": "output",
            "dtype": "float32"
          }
        }
      ]
    }
  },
  "format": "layers-model",
  "generatedBy": "manual-export",
  "convertedBy": null,
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_0/kernel",
          "shape": [
            6,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_0/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "output/kernel",
          "shape": [
            128,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "output/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}